app/controllers/school_classes_controller.rb

    def create
        @school_class = SchoolClass.create(school_classes_params(:title,:room_number))
---
INSERT INTO "school_classes" ("title", "room_number") VALUES (?, ?)  [["title", "Arzay"], ["room_number", 123213]]

    def update
        @school_class = SchoolClass.find(params[:id])
        @school_class.update(school_classes_params(:title,:room_number))
---
SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
UPDATE "school_classes" SET "title" = ?, "room_number" = ? WHERE "school_classes"."id" = ?  [["title", "Software Super Cox"], ["room_number", 69696969], ["id", 5]]