app/controllers/students_controller.rb

INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "arzyarzy"], ["last_name", "holahola"], ["created_at", "2021-02-21 06:39:17.855892"], ["updated_at", "2021-02-21 06:39:17.855892"]]
---
    def create
        @student = Student.create(students_params(:first_name,:last_name))

SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "students" SET "first_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", "rx"], ["updated_at", "2021-02-21 06:43:23.299239"], ["id", 3]]
---
    def update
        @student = Student.find(params[:id])
        @student.update(students_params(:first_name,:last_name))